app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` WHERE (name like '%%')
---
  def index
    @projects = Project.search(params[:search])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 871498793 LIMIT 1
SELECT `projects_users`.* FROM `projects_users` WHERE (user_id = 1 AND project_id = 871498793) LIMIT 1
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`project_id` = 871498793
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @project = Project.find(params[:id])
    @tickets_for_project = @project.tickets
    if p = ProjectsUser.find(:first,:conditions => ["user_id = ? AND project_id = ?", session[:user_id], @project.id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 871498793 LIMIT 1
---
  def edit
    @project = Project.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
INSERT INTO `projects` (`created_at`, `description`, `name`, `updated_at`, `user_id`) VALUES ('2013-03-21 12:25:43', 'MyText', 'MyProject', '2013-03-21 12:25:43', 2)
INSERT INTO `states` (`created_at`, `open`, `project_id`, `title`, `updated_at`) VALUES ('2013-03-21 12:25:43', 1, 871498794, 'open', '2013-03-21 12:25:43')
---
  def create
    @project = Project.new(params[:project])
    @project.user_id = session[:user_id]
    user = User.find(session[:user_id])
    @project.states << State.new( :project_id => @project.id, :title => 'open' , :open => true )

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 871498793 LIMIT 1
---
  def update
    @project = Project.find(params[:id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 871498793 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 871498793
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy