app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
  def all_projects
    @projects = Project.all