app/controllers/states_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def new
    @state = State.new
    @project = Project.find(params[:project_id])

SELECT `states`.* FROM `states` WHERE `states`.`project_id` = 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def index
    @states = State.where(:project_id => (params[:project_id]))
    @project = Project.find(params[:project_id])

SELECT `states`.* FROM `states` WHERE `states`.`id` = 980190962 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def edit
    @state = State.find(params[:id])
    @project = Project.find(@state.project_id)

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
INSERT INTO `states` (`created_at`, `open`, `project_id`, `title`, `updated_at`) VALUES ('2013-03-21 12:06:57', 0, 1, 'MyString', '2013-03-21 12:06:57')
---
  def create
    @state = State.new(params[:state])
    @project = Project.find(@state.project_id)
    respond_to do |format|
      if @state.save

SELECT `states`.* FROM `states` WHERE `states`.`id` = 980190962 LIMIT 1
---
  def update
    @state = State.find(params[:id])

SELECT `states`.* FROM `states` WHERE `states`.`id` = 980190962 LIMIT 1
DELETE FROM `states` WHERE `states`.`id` = 980190962
---
  def destroy
    @state = State.find(params[:id])
    @state.destroy