app/controllers/tickets_controller.rb

  def index
    @tickets = Ticket.search(params[:search_ticket], params[:search_by])
---
SELECT `tickets`.* FROM `tickets` WHERE (title like '%%' Or description like '%%')

  def show
    @ticket = Ticket.find(params[:id])
    @project = Project.find(@ticket.project_id)
    @creator = User.find(@ticket.creator)

    @assigned_to = begin
      User.find(@ticket.assigned_to)
      rescue ActiveRecord::RecordNotFound
      @creator
    end

    @state = State.find(@ticket.state)
---
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 7973517 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `states`.* FROM `states` WHERE `states`.`id` = 0 LIMIT 1

  def new
    @ticket = Ticket.new
    @project = Project.find(params[:project_id])
    @user = User.find(session[:user_id])
    @can_assign_to = @project.users + [@project.owner]
    @states_for_ticket = State.find(:all, :conditions => ["project_id = ?" , @project.id ])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `states`.* FROM `states` WHERE (project_id = 1)
SELECT `users`.* FROM `users` INNER JOIN `projects_users` ON `users`.`id` = `projects_users`.`user_id` WHERE `projects_users`.`project_id` = 1

  def edit
    @ticket = Ticket.find(params[:id])
    @user = User.find(session[:user_id])
    @project = Project.find(params[:project_id])
---
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 7973517 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def create
    @ticket = Ticket.new(params[:ticket])
    @user = User.find(session[:user_id])

    respond_to do |format|
      if @ticket.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `tickets` (`assigned_to`, `created_at`, `description`, `project_id`, `state`, `title`, `updated_at`, `user_id`) VALUES (1, '2013-03-22 06:35:14', 'MyText', 1, 0, 'MyString', '2013-03-22 06:35:14', 1)

  def update
    @ticket = Ticket.find(params[:id])
    @project = Project.find(@ticket.project_id)
---
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 7973517 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def destroy
    @ticket = Ticket.find(params[:id])
    @ticket.destroy
    @user = User.find(session[:user_id])
---
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 7973517 LIMIT 1
DELETE FROM `tickets` WHERE `tickets`.`id` = 7973517
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1