app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @projects_owned = [Project.find_by_user_id(@user.id)].flatten
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE (user_id = 1)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `name`, `password_digest`, `updated_at`) VALUES ('2013-03-22 08:02:35', 'valid@email.com', 'pinky', 'pinky', '2013-03-22 08:02:35')

  def update
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1